/*********************************************************************
    程序名:101 四位密码器
    作者: 俞沈岩
    日期: 2021-11-07 11:09
    说明: 加强刻晴！
*********************************************************************/
#include <stdio.h>

int main() {
	char a[4];
	int i;
	scanf("%c%c%c%c", &a[0], &a[1], &a[2], &a[3]);
	for (i = 0; i < 4; i++) {
		if (a[i] >= 'a' && a[i] <= 'z') {
			a[i] -= 32;
			continue;
		}
		if (a[i] >= 'A' && a[i] <= 'Z') {
			a[i] += 32;
			continue;
		}
		if (a[i] >= '0' && a[i] <= '9') {
			a[i] = '*';
			continue;
		}
		a[i] = '@';
	}
	printf("%c%c%c%c", a[0], a[1], a[2], a[3]);
	return 0;
}
