/*********************************************************************
    程序名:196 输出金字塔
    作者: 俞沈岩
    日期: 2021-11-12 15:01
    说明: 加强刻晴！
*********************************************************************/
#include <stdio.h>

int main() {
	char x, i, j, k, l;
	scanf("%c", &x);
	for (i = 'A'; i <= x; i++) {
		for (j = i; j < x; j++) {
			printf(" ");
		}
		for (k = 'A'; k < i; k++) {
			printf("%c", k);
		}
		for (l = k; l >= 'A'; l--) {
			printf("%c", l);
		}
		printf("\n");
	}
	return 0;
}
