/*********************************************************************
    程序名:40 等差数列
    作者: 俞沈岩
    日期: 2021-11-13 11:45
    说明: 加强刻晴！
*********************************************************************/
#include <stdio.h>

int main()
{
	int n, i, d, temp;
	scanf("%d", &n); //输入n，表示序列长度
	int a[n];
	for (i = 0; i < n; i++)
	{
		scanf("%d", &a[i]); //输入n个整数
	}
	for (i = 0; i < n; i++)
	{
		for (int j = i, k = i + 1; k < n; k++)
		{
			if (a[j] < a[k])
			{
				j = k;
			}
			temp = a[j];
			a[j] = a[k];
			a[k] = temp;
		}
	} //用选择排序法对输入数字进行排序(由大到小）
	d = a[1] - a[0];
	for (i = 2; i < n; i++)
	{
		if (a[i] - a[i - 1] != d)
		{ //判断相邻两项的差是否与a[i]-a[0]相同
			printf("no");
			return 0;
		}
	}
	/*if (d < 0)
		d = -d; */
	//由于数字有大到小排序，故不需要进行取绝对值操作
	printf("%d", d);
	return 0;
}
