/*********************************************************************
    Program :44 斐波那契数列素数判断
    Author: 俞沈岩
    Date: 2021-11-21 16:25
    Note : 加强刻晴！
*********************************************************************/
#include <stdio.h>

int main() {
	int n, i;
	scanf("%d", &n);
	int a[40] = { 1, 1 };
	for (i = 2; i <= n - 1; i++) {
		a[i] = a[i - 1] + a[i - 2];
	}
	for (int j = 2; j < n; j++) {
		if (a[n - 1] % j == 0 && a[n - 1] != j) {
			printf("%d", a[n - 1]);
			return 0;
		}



	}
	printf("yes");
	return 0;
}
