/*********************************************************************
    程序名:64 自然数分解
    作者: 俞沈岩
    日期: 2021-10-31 11:01
    说明: 加强刻晴！
*********************************************************************/
#include <stdio.h>

int main()
{
	int m, i, j, sum;
	scanf("%d", &m);
	for (i = 1; i <= m * m; i += 2)
	{
		sum = m * (m - 1 + i);
		//printf("/*%d*/", sum);
		if (sum == m * m * m)
		{
			for (j = 0; j < m; j++)
			{
				printf("%d ", i);
				i += 2;
			}
			return 0;
		}

	}
	return 0;
}
