/*********************************************************************
    程序名:87 跳一跳
    作者: 俞沈岩
    日期: 2021-10-31 12:13
    说明: 加强刻晴！
*********************************************************************/
#include <stdio.h>

int main() {
	int a[1000], i, score = 0, plus = 0;
	scanf("%d", &a[0]);
	for (i = 1; a[i - 1] != 0; i++) {
		scanf("%d", &a[i]);
	}
	for (i = 0; a[i] != 0; i++) {
		if (a[i] == 1) {
			score++;
			plus = 0;
		}
		if (a[i] == 2) {
			plus += 2;
			score += plus;
		}
		if (a[i] == 0) {
			printf("%d", score);
			return 0;
		}
	}
	printf("%d", score);
	return 0;
}
