/*********************************************************************
    程序名:99 阶梯电价2
    作者: 俞沈岩
    日期: 2021-11-07 10:58
    说明: 加强刻晴！
*********************************************************************/
#include <stdio.h>

int main() {
	float a;
	scanf("%f", &a);
	if (a < 0)
		printf("nmsl");
	if (a <= 110) {
		printf("%.2f A 0.00", a / 2);
		return 0;
	}
	if (a <= 210) {
		printf("%.2f B %.2f", 55 + 0.55 * (a - 110), a - 110);
		return 0;
	}
	if (a > 210) {
		printf("%.2f C %.2f", 110 + 0.70 * (a - 210), a - 210);
		return 0;
	}
	return 0;
}
